konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pio.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : PIO
# Version        : 1
# Bus type       : ahbl
# Description    : Programmable IO block
# =============================================================================
.ifndef	_HARDWARE_REGS_PIO_H
.set	_HARDWARE_REGS_PIO_H, 1
# =============================================================================
# Register    : PIO_CTRL
# Description : PIO control register
.equ	PIO_CTRL_OFFSET, 0x00000000
.equ	PIO_CTRL_BITS, 0x07ff0fff
.equ	PIO_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_NEXTPREV_CLKDIV_RESTART
# Description : Write 1 to restart the clock dividers of state machines in
#               neighbouring PIO blocks, as specified by NEXT_PIO_MASK and
#               PREV_PIO_MASK in the same write.
#
#               This is equivalent to writing 1 to the corresponding
#               CLKDIV_RESTART bits in those PIOs' CTRL registers.
.equ	PIO_CTRL_NEXTPREV_CLKDIV_RESTART_RESET, 0x0
.equ	PIO_CTRL_NEXTPREV_CLKDIV_RESTART_BITS, 0x04000000
.equ	PIO_CTRL_NEXTPREV_CLKDIV_RESTART_MSB, 26
.equ	PIO_CTRL_NEXTPREV_CLKDIV_RESTART_LSB, 26
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_NEXTPREV_SM_DISABLE
# Description : Write 1 to disable state machines in neighbouring PIO blocks,
#               as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same
#               write.
#
#               This is equivalent to clearing the corresponding SM_ENABLE bits
#               in those PIOs' CTRL registers.
.equ	PIO_CTRL_NEXTPREV_SM_DISABLE_RESET, 0x0
.equ	PIO_CTRL_NEXTPREV_SM_DISABLE_BITS, 0x02000000
.equ	PIO_CTRL_NEXTPREV_SM_DISABLE_MSB, 25
.equ	PIO_CTRL_NEXTPREV_SM_DISABLE_LSB, 25
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_NEXTPREV_SM_ENABLE
# Description : Write 1 to enable state machines in neighbouring PIO blocks, as
#               specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.
#
#               This is equivalent to setting the corresponding SM_ENABLE bits
#               in those PIOs' CTRL registers.
#
#               If both OTHERS_SM_ENABLE and OTHERS_SM_DISABLE are set, the
#               disable takes precedence.
.equ	PIO_CTRL_NEXTPREV_SM_ENABLE_RESET, 0x0
.equ	PIO_CTRL_NEXTPREV_SM_ENABLE_BITS, 0x01000000
.equ	PIO_CTRL_NEXTPREV_SM_ENABLE_MSB, 24
.equ	PIO_CTRL_NEXTPREV_SM_ENABLE_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_NEXT_PIO_MASK
# Description : A mask of state machines in the neighbouring higher-numbered
#               PIO block in the system (or PIO block 0 if this is the highest-
#               numbered PIO block) to which to apply the operations specified
#               by NEXTPREV_CLKDIV_RESTART, NEXTPREV_SM_ENABLE, and
#               NEXTPREV_SM_DISABLE in the same write.
#
#               This allows state machines in a neighbouring PIO block to be
#               started/stopped/clock-synced exactly simultaneously with a
#               write to this PIO block's CTRL register.
#
#               Note that in a system with two PIOs, NEXT_PIO_MASK and
#               PREV_PIO_MASK actually indicate the same PIO block. In this
#               case the effects are applied cumulatively (as though the masks
#               were OR'd together).
#
#               Neighbouring PIO blocks are disconnected (status signals tied
#               to 0 and control signals ignored) if one block is accessible to
#               NonSecure code, and one is not.
.equ	PIO_CTRL_NEXT_PIO_MASK_RESET, 0x0
.equ	PIO_CTRL_NEXT_PIO_MASK_BITS, 0x00f00000
.equ	PIO_CTRL_NEXT_PIO_MASK_MSB, 23
.equ	PIO_CTRL_NEXT_PIO_MASK_LSB, 20
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_PREV_PIO_MASK
# Description : A mask of state machines in the neighbouring lower-numbered PIO
#               block in the system (or the highest-numbered PIO block if this
#               is PIO block 0) to which to apply the operations specified by
#               OP_CLKDIV_RESTART, OP_ENABLE, OP_DISABLE in the same write.
#
#               This allows state machines in a neighbouring PIO block to be
#               started/stopped/clock-synced exactly simultaneously with a
#               write to this PIO block's CTRL register.
#
#               Neighbouring PIO blocks are disconnected (status signals tied
#               to 0 and control signals ignored) if one block is accessible to
#               NonSecure code, and one is not.
.equ	PIO_CTRL_PREV_PIO_MASK_RESET, 0x0
.equ	PIO_CTRL_PREV_PIO_MASK_BITS, 0x000f0000
.equ	PIO_CTRL_PREV_PIO_MASK_MSB, 19
.equ	PIO_CTRL_PREV_PIO_MASK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_CLKDIV_RESTART
# Description : Restart a state machine's clock divider from an initial phase
#               of 0. Clock dividers are free-running, so once started, their
#               output (including fractional jitter) is completely determined
#               by the integer/fractional divisor configured in SMx_CLKDIV.
#               This means that, if multiple clock dividers with the same
#               divisor are restarted simultaneously, by writing multiple 1
#               bits to this field, the execution clocks of those state
#               machines will run in precise lockstep.
#
#               Note that setting/clearing SM_ENABLE does not stop the clock
#               divider from running, so once multiple state machines' clocks
#               are synchronised, it is safe to disable/reenable a state
#               machine, whilst keeping the clock dividers in sync.
#
#               Note also that CLKDIV_RESTART can be written to whilst the
#               state machine is running, and this is useful to resynchronise
#               clock dividers after the divisors (SMx_CLKDIV) have been
#               changed on-the-fly.
.equ	PIO_CTRL_CLKDIV_RESTART_RESET, 0x0
.equ	PIO_CTRL_CLKDIV_RESTART_BITS, 0x00000f00
.equ	PIO_CTRL_CLKDIV_RESTART_MSB, 11
.equ	PIO_CTRL_CLKDIV_RESTART_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_SM_RESTART
# Description : Write 1 to instantly clear internal SM state which may be
#               otherwise difficult to access and will affect future execution.
#
#               Specifically, the following are cleared: input and output shift
#               counters; the contents of the input shift register; the delay
#               counter; the waiting-on-IRQ state; any stalled instruction
#               written to SMx_INSTR or run by OUT/MOV EXEC; any pin write left
#               asserted due to OUT_STICKY.
#
#               The contents of the output shift register and the X/Y scratch
#               registers are not affected.
.equ	PIO_CTRL_SM_RESTART_RESET, 0x0
.equ	PIO_CTRL_SM_RESTART_BITS, 0x000000f0
.equ	PIO_CTRL_SM_RESTART_MSB, 7
.equ	PIO_CTRL_SM_RESTART_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_CTRL_SM_ENABLE
# Description : Enable/disable each of the four state machines by writing 1/0
#               to each of these four bits. When disabled, a state machine will
#               cease executing instructions, except those written directly to
#               SMx_INSTR by the system. Multiple bits can be set/cleared at
#               once to run/halt multiple state machines simultaneously.
.equ	PIO_CTRL_SM_ENABLE_RESET, 0x0
.equ	PIO_CTRL_SM_ENABLE_BITS, 0x0000000f
.equ	PIO_CTRL_SM_ENABLE_MSB, 3
.equ	PIO_CTRL_SM_ENABLE_LSB, 0
# =============================================================================
# Register    : PIO_FSTAT
# Description : FIFO status register
.equ	PIO_FSTAT_OFFSET, 0x00000004
.equ	PIO_FSTAT_BITS, 0x0f0f0f0f
.equ	PIO_FSTAT_RESET, 0x0f000f00
# -----------------------------------------------------------------------------
# Field       : PIO_FSTAT_TXEMPTY
# Description : State machine TX FIFO is empty
.equ	PIO_FSTAT_TXEMPTY_RESET, 0xf
.equ	PIO_FSTAT_TXEMPTY_BITS, 0x0f000000
.equ	PIO_FSTAT_TXEMPTY_MSB, 27
.equ	PIO_FSTAT_TXEMPTY_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_FSTAT_TXFULL
# Description : State machine TX FIFO is full
.equ	PIO_FSTAT_TXFULL_RESET, 0x0
.equ	PIO_FSTAT_TXFULL_BITS, 0x000f0000
.equ	PIO_FSTAT_TXFULL_MSB, 19
.equ	PIO_FSTAT_TXFULL_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_FSTAT_RXEMPTY
# Description : State machine RX FIFO is empty
.equ	PIO_FSTAT_RXEMPTY_RESET, 0xf
.equ	PIO_FSTAT_RXEMPTY_BITS, 0x00000f00
.equ	PIO_FSTAT_RXEMPTY_MSB, 11
.equ	PIO_FSTAT_RXEMPTY_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_FSTAT_RXFULL
# Description : State machine RX FIFO is full
.equ	PIO_FSTAT_RXFULL_RESET, 0x0
.equ	PIO_FSTAT_RXFULL_BITS, 0x0000000f
.equ	PIO_FSTAT_RXFULL_MSB, 3
.equ	PIO_FSTAT_RXFULL_LSB, 0
# =============================================================================
# Register    : PIO_FDEBUG
# Description : FIFO debug register
.equ	PIO_FDEBUG_OFFSET, 0x00000008
.equ	PIO_FDEBUG_BITS, 0x0f0f0f0f
.equ	PIO_FDEBUG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_FDEBUG_TXSTALL
# Description : State machine has stalled on empty TX FIFO during a blocking
#               PULL, or an OUT with autopull enabled. Write 1 to clear.
.equ	PIO_FDEBUG_TXSTALL_RESET, 0x0
.equ	PIO_FDEBUG_TXSTALL_BITS, 0x0f000000
.equ	PIO_FDEBUG_TXSTALL_MSB, 27
.equ	PIO_FDEBUG_TXSTALL_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_FDEBUG_TXOVER
# Description : TX FIFO overflow (i.e. write-on-full by the system) has
#               occurred. Write 1 to clear. Note that write-on-full does not
#               alter the state or contents of the FIFO in any way, but the
#               data that the system attempted to write is dropped, so if this
#               flag is set, your software has quite likely dropped some data
#               on the floor.
.equ	PIO_FDEBUG_TXOVER_RESET, 0x0
.equ	PIO_FDEBUG_TXOVER_BITS, 0x000f0000
.equ	PIO_FDEBUG_TXOVER_MSB, 19
.equ	PIO_FDEBUG_TXOVER_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_FDEBUG_RXUNDER
# Description : RX FIFO underflow (i.e. read-on-empty by the system) has
#               occurred. Write 1 to clear. Note that read-on-empty does not
#               perturb the state of the FIFO in any way, but the data returned
#               by reading from an empty FIFO is undefined, so this flag
#               generally only becomes set due to some kind of software error.
.equ	PIO_FDEBUG_RXUNDER_RESET, 0x0
.equ	PIO_FDEBUG_RXUNDER_BITS, 0x00000f00
.equ	PIO_FDEBUG_RXUNDER_MSB, 11
.equ	PIO_FDEBUG_RXUNDER_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_FDEBUG_RXSTALL
# Description : State machine has stalled on full RX FIFO during a blocking
#               PUSH, or an IN with autopush enabled. This flag is also set
#               when a nonblocking PUSH to a full FIFO took place, in which
#               case the state machine has dropped data. Write 1 to clear.
.equ	PIO_FDEBUG_RXSTALL_RESET, 0x0
.equ	PIO_FDEBUG_RXSTALL_BITS, 0x0000000f
.equ	PIO_FDEBUG_RXSTALL_MSB, 3
.equ	PIO_FDEBUG_RXSTALL_LSB, 0
# =============================================================================
# Register    : PIO_FLEVEL
# Description : FIFO levels
.equ	PIO_FLEVEL_OFFSET, 0x0000000c
.equ	PIO_FLEVEL_BITS, 0xffffffff
.equ	PIO_FLEVEL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_RX3
.equ	PIO_FLEVEL_RX3_RESET, 0x0
.equ	PIO_FLEVEL_RX3_BITS, 0xf0000000
.equ	PIO_FLEVEL_RX3_MSB, 31
.equ	PIO_FLEVEL_RX3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_TX3
.equ	PIO_FLEVEL_TX3_RESET, 0x0
.equ	PIO_FLEVEL_TX3_BITS, 0x0f000000
.equ	PIO_FLEVEL_TX3_MSB, 27
.equ	PIO_FLEVEL_TX3_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_RX2
.equ	PIO_FLEVEL_RX2_RESET, 0x0
.equ	PIO_FLEVEL_RX2_BITS, 0x00f00000
.equ	PIO_FLEVEL_RX2_MSB, 23
.equ	PIO_FLEVEL_RX2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_TX2
.equ	PIO_FLEVEL_TX2_RESET, 0x0
.equ	PIO_FLEVEL_TX2_BITS, 0x000f0000
.equ	PIO_FLEVEL_TX2_MSB, 19
.equ	PIO_FLEVEL_TX2_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_RX1
.equ	PIO_FLEVEL_RX1_RESET, 0x0
.equ	PIO_FLEVEL_RX1_BITS, 0x0000f000
.equ	PIO_FLEVEL_RX1_MSB, 15
.equ	PIO_FLEVEL_RX1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_TX1
.equ	PIO_FLEVEL_TX1_RESET, 0x0
.equ	PIO_FLEVEL_TX1_BITS, 0x00000f00
.equ	PIO_FLEVEL_TX1_MSB, 11
.equ	PIO_FLEVEL_TX1_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_RX0
.equ	PIO_FLEVEL_RX0_RESET, 0x0
.equ	PIO_FLEVEL_RX0_BITS, 0x000000f0
.equ	PIO_FLEVEL_RX0_MSB, 7
.equ	PIO_FLEVEL_RX0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_FLEVEL_TX0
.equ	PIO_FLEVEL_TX0_RESET, 0x0
.equ	PIO_FLEVEL_TX0_BITS, 0x0000000f
.equ	PIO_FLEVEL_TX0_MSB, 3
.equ	PIO_FLEVEL_TX0_LSB, 0
# =============================================================================
# Register    : PIO_TXF0
# Description : Direct write access to the TX FIFO for this state machine. Each
#               write pushes one word to the FIFO. Attempting to write to a
#               full FIFO has no effect on the FIFO state or contents, and sets
#               the sticky FDEBUG_TXOVER error flag for this FIFO.
.equ	PIO_TXF0_OFFSET, 0x00000010
.equ	PIO_TXF0_BITS, 0xffffffff
.equ	PIO_TXF0_RESET, 0x00000000
.equ	PIO_TXF0_MSB, 31
.equ	PIO_TXF0_LSB, 0
# =============================================================================
# Register    : PIO_TXF1
# Description : Direct write access to the TX FIFO for this state machine. Each
#               write pushes one word to the FIFO. Attempting to write to a
#               full FIFO has no effect on the FIFO state or contents, and sets
#               the sticky FDEBUG_TXOVER error flag for this FIFO.
.equ	PIO_TXF1_OFFSET, 0x00000014
.equ	PIO_TXF1_BITS, 0xffffffff
.equ	PIO_TXF1_RESET, 0x00000000
.equ	PIO_TXF1_MSB, 31
.equ	PIO_TXF1_LSB, 0
# =============================================================================
# Register    : PIO_TXF2
# Description : Direct write access to the TX FIFO for this state machine. Each
#               write pushes one word to the FIFO. Attempting to write to a
#               full FIFO has no effect on the FIFO state or contents, and sets
#               the sticky FDEBUG_TXOVER error flag for this FIFO.
.equ	PIO_TXF2_OFFSET, 0x00000018
.equ	PIO_TXF2_BITS, 0xffffffff
.equ	PIO_TXF2_RESET, 0x00000000
.equ	PIO_TXF2_MSB, 31
.equ	PIO_TXF2_LSB, 0
# =============================================================================
# Register    : PIO_TXF3
# Description : Direct write access to the TX FIFO for this state machine. Each
#               write pushes one word to the FIFO. Attempting to write to a
#               full FIFO has no effect on the FIFO state or contents, and sets
#               the sticky FDEBUG_TXOVER error flag for this FIFO.
.equ	PIO_TXF3_OFFSET, 0x0000001c
.equ	PIO_TXF3_BITS, 0xffffffff
.equ	PIO_TXF3_RESET, 0x00000000
.equ	PIO_TXF3_MSB, 31
.equ	PIO_TXF3_LSB, 0
# =============================================================================
# Register    : PIO_RXF0
# Description : Direct read access to the RX FIFO for this state machine. Each
#               read pops one word from the FIFO. Attempting to read from an
#               empty FIFO has no effect on the FIFO state, and sets the sticky
#               FDEBUG_RXUNDER error flag for this FIFO. The data returned to
#               the system on a read from an empty FIFO is undefined.
.equ	PIO_RXF0_OFFSET, 0x00000020
.equ	PIO_RXF0_BITS, 0xffffffff
.equ	PIO_RXF0_MSB, 31
.equ	PIO_RXF0_LSB, 0
# =============================================================================
# Register    : PIO_RXF1
# Description : Direct read access to the RX FIFO for this state machine. Each
#               read pops one word from the FIFO. Attempting to read from an
#               empty FIFO has no effect on the FIFO state, and sets the sticky
#               FDEBUG_RXUNDER error flag for this FIFO. The data returned to
#               the system on a read from an empty FIFO is undefined.
.equ	PIO_RXF1_OFFSET, 0x00000024
.equ	PIO_RXF1_BITS, 0xffffffff
.equ	PIO_RXF1_MSB, 31
.equ	PIO_RXF1_LSB, 0
# =============================================================================
# Register    : PIO_RXF2
# Description : Direct read access to the RX FIFO for this state machine. Each
#               read pops one word from the FIFO. Attempting to read from an
#               empty FIFO has no effect on the FIFO state, and sets the sticky
#               FDEBUG_RXUNDER error flag for this FIFO. The data returned to
#               the system on a read from an empty FIFO is undefined.
.equ	PIO_RXF2_OFFSET, 0x00000028
.equ	PIO_RXF2_BITS, 0xffffffff
.equ	PIO_RXF2_MSB, 31
.equ	PIO_RXF2_LSB, 0
# =============================================================================
# Register    : PIO_RXF3
# Description : Direct read access to the RX FIFO for this state machine. Each
#               read pops one word from the FIFO. Attempting to read from an
#               empty FIFO has no effect on the FIFO state, and sets the sticky
#               FDEBUG_RXUNDER error flag for this FIFO. The data returned to
#               the system on a read from an empty FIFO is undefined.
.equ	PIO_RXF3_OFFSET, 0x0000002c
.equ	PIO_RXF3_BITS, 0xffffffff
.equ	PIO_RXF3_MSB, 31
.equ	PIO_RXF3_LSB, 0
# =============================================================================
# Register    : PIO_IRQ
# Description : State machine IRQ flags register. Write 1 to clear. There are
#               eight state machine IRQ flags, which can be set, cleared, and
#               waited on by the state machines. There's no fixed association
#               between flags and state machines -- any state machine can use
#               any flag.
#
#               Any of the eight flags can be used for timing synchronisation
#               between state machines, using IRQ and WAIT instructions. Any
#               combination of the eight flags can also routed out to either of
#               the two system-level interrupt requests, alongside FIFO status
#               interrupts -- see e.g. IRQ0_INTE.
.equ	PIO_IRQ_OFFSET, 0x00000030
.equ	PIO_IRQ_BITS, 0x000000ff
.equ	PIO_IRQ_RESET, 0x00000000
.equ	PIO_IRQ_MSB, 7
.equ	PIO_IRQ_LSB, 0
# =============================================================================
# Register    : PIO_IRQ_FORCE
# Description : Writing a 1 to each of these bits will forcibly assert the
#               corresponding IRQ. Note this is different to the INTF register:
#               writing here affects PIO internal state. INTF just asserts the
#               processor-facing IRQ signal for testing ISRs, and is not
#               visible to the state machines.
.equ	PIO_IRQ_FORCE_OFFSET, 0x00000034
.equ	PIO_IRQ_FORCE_BITS, 0x000000ff
.equ	PIO_IRQ_FORCE_RESET, 0x00000000
.equ	PIO_IRQ_FORCE_MSB, 7
.equ	PIO_IRQ_FORCE_LSB, 0
# =============================================================================
# Register    : PIO_INPUT_SYNC_BYPASS
# Description : There is a 2-flipflop synchronizer on each GPIO input, which
#               protects PIO logic from metastabilities. This increases input
#               delay, and for fast synchronous IO (e.g. SPI) these
#               synchronizers may need to be bypassed. Each bit in this
#               register corresponds to one GPIO.
#               0 -> input is synchronized (default)
#               1 -> synchronizer is bypassed
#               If in doubt, leave this register as all zeroes.
.equ	PIO_INPUT_SYNC_BYPASS_OFFSET, 0x00000038
.equ	PIO_INPUT_SYNC_BYPASS_BITS, 0xffffffff
.equ	PIO_INPUT_SYNC_BYPASS_RESET, 0x00000000
.equ	PIO_INPUT_SYNC_BYPASS_MSB, 31
.equ	PIO_INPUT_SYNC_BYPASS_LSB, 0
# =============================================================================
# Register    : PIO_DBG_PADOUT
# Description : Read to sample the pad output values PIO is currently driving
#               to the GPIOs. On RP2040 there are 30 GPIOs, so the two most
#               significant bits are hardwired to 0.
.equ	PIO_DBG_PADOUT_OFFSET, 0x0000003c
.equ	PIO_DBG_PADOUT_BITS, 0xffffffff
.equ	PIO_DBG_PADOUT_RESET, 0x00000000
.equ	PIO_DBG_PADOUT_MSB, 31
.equ	PIO_DBG_PADOUT_LSB, 0
# =============================================================================
# Register    : PIO_DBG_PADOE
# Description : Read to sample the pad output enables (direction) PIO is
#               currently driving to the GPIOs. On RP2040 there are 30 GPIOs,
#               so the two most significant bits are hardwired to 0.
.equ	PIO_DBG_PADOE_OFFSET, 0x00000040
.equ	PIO_DBG_PADOE_BITS, 0xffffffff
.equ	PIO_DBG_PADOE_RESET, 0x00000000
.equ	PIO_DBG_PADOE_MSB, 31
.equ	PIO_DBG_PADOE_LSB, 0
# =============================================================================
# Register    : PIO_DBG_CFGINFO
# Description : The PIO hardware has some free parameters that may vary between
#               chip products.
#               These should be provided in the chip datasheet, but are also
#               exposed here.
.equ	PIO_DBG_CFGINFO_OFFSET, 0x00000044
.equ	PIO_DBG_CFGINFO_BITS, 0xf03f0f3f
.equ	PIO_DBG_CFGINFO_RESET, 0x10000000
# -----------------------------------------------------------------------------
# Field       : PIO_DBG_CFGINFO_VERSION
# Description : Version of the core PIO hardware.
#               0x0 -> Version 0 (RP2040)
#               0x1 -> Version 1 (RP2350)
.equ	PIO_DBG_CFGINFO_VERSION_RESET, 0x1
.equ	PIO_DBG_CFGINFO_VERSION_BITS, 0xf0000000
.equ	PIO_DBG_CFGINFO_VERSION_MSB, 31
.equ	PIO_DBG_CFGINFO_VERSION_LSB, 28
.equ	PIO_DBG_CFGINFO_VERSION_VALUE_V0, 0x0
.equ	PIO_DBG_CFGINFO_VERSION_VALUE_V1, 0x1
# -----------------------------------------------------------------------------
# Field       : PIO_DBG_CFGINFO_IMEM_SIZE
# Description : The size of the instruction memory, measured in units of one
#               instruction
.equ	PIO_DBG_CFGINFO_IMEM_SIZE_BITS, 0x003f0000
.equ	PIO_DBG_CFGINFO_IMEM_SIZE_MSB, 21
.equ	PIO_DBG_CFGINFO_IMEM_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_DBG_CFGINFO_SM_COUNT
# Description : The number of state machines this PIO instance is equipped
#               with.
.equ	PIO_DBG_CFGINFO_SM_COUNT_BITS, 0x00000f00
.equ	PIO_DBG_CFGINFO_SM_COUNT_MSB, 11
.equ	PIO_DBG_CFGINFO_SM_COUNT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_DBG_CFGINFO_FIFO_DEPTH
# Description : The depth of the state machine TX/RX FIFOs, measured in words.
#               Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double
#               this depth.
