konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pio.inc
.equ	PIO_DBG_CFGINFO_FIFO_DEPTH_BITS, 0x0000003f
.equ	PIO_DBG_CFGINFO_FIFO_DEPTH_MSB, 5
.equ	PIO_DBG_CFGINFO_FIFO_DEPTH_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM0
# Description : Write-only access to instruction memory location 0
.equ	PIO_INSTR_MEM0_OFFSET, 0x00000048
.equ	PIO_INSTR_MEM0_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM0_RESET, 0x00000000
.equ	PIO_INSTR_MEM0_MSB, 15
.equ	PIO_INSTR_MEM0_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM1
# Description : Write-only access to instruction memory location 1
.equ	PIO_INSTR_MEM1_OFFSET, 0x0000004c
.equ	PIO_INSTR_MEM1_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM1_RESET, 0x00000000
.equ	PIO_INSTR_MEM1_MSB, 15
.equ	PIO_INSTR_MEM1_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM2
# Description : Write-only access to instruction memory location 2
.equ	PIO_INSTR_MEM2_OFFSET, 0x00000050
.equ	PIO_INSTR_MEM2_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM2_RESET, 0x00000000
.equ	PIO_INSTR_MEM2_MSB, 15
.equ	PIO_INSTR_MEM2_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM3
# Description : Write-only access to instruction memory location 3
.equ	PIO_INSTR_MEM3_OFFSET, 0x00000054
.equ	PIO_INSTR_MEM3_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM3_RESET, 0x00000000
.equ	PIO_INSTR_MEM3_MSB, 15
.equ	PIO_INSTR_MEM3_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM4
# Description : Write-only access to instruction memory location 4
.equ	PIO_INSTR_MEM4_OFFSET, 0x00000058
.equ	PIO_INSTR_MEM4_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM4_RESET, 0x00000000
.equ	PIO_INSTR_MEM4_MSB, 15
.equ	PIO_INSTR_MEM4_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM5
# Description : Write-only access to instruction memory location 5
.equ	PIO_INSTR_MEM5_OFFSET, 0x0000005c
.equ	PIO_INSTR_MEM5_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM5_RESET, 0x00000000
.equ	PIO_INSTR_MEM5_MSB, 15
.equ	PIO_INSTR_MEM5_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM6
# Description : Write-only access to instruction memory location 6
.equ	PIO_INSTR_MEM6_OFFSET, 0x00000060
.equ	PIO_INSTR_MEM6_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM6_RESET, 0x00000000
.equ	PIO_INSTR_MEM6_MSB, 15
.equ	PIO_INSTR_MEM6_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM7
# Description : Write-only access to instruction memory location 7
.equ	PIO_INSTR_MEM7_OFFSET, 0x00000064
.equ	PIO_INSTR_MEM7_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM7_RESET, 0x00000000
.equ	PIO_INSTR_MEM7_MSB, 15
.equ	PIO_INSTR_MEM7_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM8
# Description : Write-only access to instruction memory location 8
.equ	PIO_INSTR_MEM8_OFFSET, 0x00000068
.equ	PIO_INSTR_MEM8_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM8_RESET, 0x00000000
.equ	PIO_INSTR_MEM8_MSB, 15
.equ	PIO_INSTR_MEM8_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM9
# Description : Write-only access to instruction memory location 9
.equ	PIO_INSTR_MEM9_OFFSET, 0x0000006c
.equ	PIO_INSTR_MEM9_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM9_RESET, 0x00000000
.equ	PIO_INSTR_MEM9_MSB, 15
.equ	PIO_INSTR_MEM9_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM10
# Description : Write-only access to instruction memory location 10
.equ	PIO_INSTR_MEM10_OFFSET, 0x00000070
.equ	PIO_INSTR_MEM10_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM10_RESET, 0x00000000
.equ	PIO_INSTR_MEM10_MSB, 15
.equ	PIO_INSTR_MEM10_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM11
# Description : Write-only access to instruction memory location 11
.equ	PIO_INSTR_MEM11_OFFSET, 0x00000074
.equ	PIO_INSTR_MEM11_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM11_RESET, 0x00000000
.equ	PIO_INSTR_MEM11_MSB, 15
.equ	PIO_INSTR_MEM11_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM12
# Description : Write-only access to instruction memory location 12
.equ	PIO_INSTR_MEM12_OFFSET, 0x00000078
.equ	PIO_INSTR_MEM12_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM12_RESET, 0x00000000
.equ	PIO_INSTR_MEM12_MSB, 15
.equ	PIO_INSTR_MEM12_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM13
# Description : Write-only access to instruction memory location 13
.equ	PIO_INSTR_MEM13_OFFSET, 0x0000007c
.equ	PIO_INSTR_MEM13_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM13_RESET, 0x00000000
.equ	PIO_INSTR_MEM13_MSB, 15
.equ	PIO_INSTR_MEM13_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM14
# Description : Write-only access to instruction memory location 14
.equ	PIO_INSTR_MEM14_OFFSET, 0x00000080
.equ	PIO_INSTR_MEM14_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM14_RESET, 0x00000000
.equ	PIO_INSTR_MEM14_MSB, 15
.equ	PIO_INSTR_MEM14_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM15
# Description : Write-only access to instruction memory location 15
.equ	PIO_INSTR_MEM15_OFFSET, 0x00000084
.equ	PIO_INSTR_MEM15_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM15_RESET, 0x00000000
.equ	PIO_INSTR_MEM15_MSB, 15
.equ	PIO_INSTR_MEM15_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM16
# Description : Write-only access to instruction memory location 16
.equ	PIO_INSTR_MEM16_OFFSET, 0x00000088
.equ	PIO_INSTR_MEM16_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM16_RESET, 0x00000000
.equ	PIO_INSTR_MEM16_MSB, 15
.equ	PIO_INSTR_MEM16_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM17
# Description : Write-only access to instruction memory location 17
.equ	PIO_INSTR_MEM17_OFFSET, 0x0000008c
.equ	PIO_INSTR_MEM17_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM17_RESET, 0x00000000
.equ	PIO_INSTR_MEM17_MSB, 15
.equ	PIO_INSTR_MEM17_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM18
# Description : Write-only access to instruction memory location 18
.equ	PIO_INSTR_MEM18_OFFSET, 0x00000090
.equ	PIO_INSTR_MEM18_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM18_RESET, 0x00000000
.equ	PIO_INSTR_MEM18_MSB, 15
.equ	PIO_INSTR_MEM18_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM19
# Description : Write-only access to instruction memory location 19
.equ	PIO_INSTR_MEM19_OFFSET, 0x00000094
.equ	PIO_INSTR_MEM19_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM19_RESET, 0x00000000
.equ	PIO_INSTR_MEM19_MSB, 15
.equ	PIO_INSTR_MEM19_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM20
# Description : Write-only access to instruction memory location 20
.equ	PIO_INSTR_MEM20_OFFSET, 0x00000098
.equ	PIO_INSTR_MEM20_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM20_RESET, 0x00000000
.equ	PIO_INSTR_MEM20_MSB, 15
.equ	PIO_INSTR_MEM20_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM21
# Description : Write-only access to instruction memory location 21
.equ	PIO_INSTR_MEM21_OFFSET, 0x0000009c
.equ	PIO_INSTR_MEM21_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM21_RESET, 0x00000000
.equ	PIO_INSTR_MEM21_MSB, 15
.equ	PIO_INSTR_MEM21_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM22
# Description : Write-only access to instruction memory location 22
.equ	PIO_INSTR_MEM22_OFFSET, 0x000000a0
.equ	PIO_INSTR_MEM22_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM22_RESET, 0x00000000
.equ	PIO_INSTR_MEM22_MSB, 15
.equ	PIO_INSTR_MEM22_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM23
# Description : Write-only access to instruction memory location 23
.equ	PIO_INSTR_MEM23_OFFSET, 0x000000a4
.equ	PIO_INSTR_MEM23_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM23_RESET, 0x00000000
.equ	PIO_INSTR_MEM23_MSB, 15
.equ	PIO_INSTR_MEM23_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM24
# Description : Write-only access to instruction memory location 24
.equ	PIO_INSTR_MEM24_OFFSET, 0x000000a8
.equ	PIO_INSTR_MEM24_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM24_RESET, 0x00000000
.equ	PIO_INSTR_MEM24_MSB, 15
.equ	PIO_INSTR_MEM24_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM25
# Description : Write-only access to instruction memory location 25
.equ	PIO_INSTR_MEM25_OFFSET, 0x000000ac
.equ	PIO_INSTR_MEM25_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM25_RESET, 0x00000000
.equ	PIO_INSTR_MEM25_MSB, 15
.equ	PIO_INSTR_MEM25_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM26
# Description : Write-only access to instruction memory location 26
.equ	PIO_INSTR_MEM26_OFFSET, 0x000000b0
.equ	PIO_INSTR_MEM26_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM26_RESET, 0x00000000
.equ	PIO_INSTR_MEM26_MSB, 15
.equ	PIO_INSTR_MEM26_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM27
# Description : Write-only access to instruction memory location 27
.equ	PIO_INSTR_MEM27_OFFSET, 0x000000b4
.equ	PIO_INSTR_MEM27_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM27_RESET, 0x00000000
.equ	PIO_INSTR_MEM27_MSB, 15
.equ	PIO_INSTR_MEM27_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM28
# Description : Write-only access to instruction memory location 28
.equ	PIO_INSTR_MEM28_OFFSET, 0x000000b8
.equ	PIO_INSTR_MEM28_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM28_RESET, 0x00000000
.equ	PIO_INSTR_MEM28_MSB, 15
.equ	PIO_INSTR_MEM28_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM29
# Description : Write-only access to instruction memory location 29
.equ	PIO_INSTR_MEM29_OFFSET, 0x000000bc
.equ	PIO_INSTR_MEM29_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM29_RESET, 0x00000000
.equ	PIO_INSTR_MEM29_MSB, 15
.equ	PIO_INSTR_MEM29_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM30
# Description : Write-only access to instruction memory location 30
.equ	PIO_INSTR_MEM30_OFFSET, 0x000000c0
.equ	PIO_INSTR_MEM30_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM30_RESET, 0x00000000
.equ	PIO_INSTR_MEM30_MSB, 15
.equ	PIO_INSTR_MEM30_LSB, 0
# =============================================================================
# Register    : PIO_INSTR_MEM31
# Description : Write-only access to instruction memory location 31
.equ	PIO_INSTR_MEM31_OFFSET, 0x000000c4
.equ	PIO_INSTR_MEM31_BITS, 0x0000ffff
.equ	PIO_INSTR_MEM31_RESET, 0x00000000
.equ	PIO_INSTR_MEM31_MSB, 15
.equ	PIO_INSTR_MEM31_LSB, 0
# =============================================================================
# Register    : PIO_SM0_CLKDIV
# Description : Clock divisor register for state machine 0
#               Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)
.equ	PIO_SM0_CLKDIV_OFFSET, 0x000000c8
.equ	PIO_SM0_CLKDIV_BITS, 0xffffff00
.equ	PIO_SM0_CLKDIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_CLKDIV_INT
# Description : Effective frequency is sysclk/(int + frac/256).
#               Value of 0 is interpreted as 65536. If INT is 0, FRAC must also
#               be 0.
.equ	PIO_SM0_CLKDIV_INT_RESET, 0x0001
.equ	PIO_SM0_CLKDIV_INT_BITS, 0xffff0000
.equ	PIO_SM0_CLKDIV_INT_MSB, 31
.equ	PIO_SM0_CLKDIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_CLKDIV_FRAC
# Description : Fractional part of clock divisor
.equ	PIO_SM0_CLKDIV_FRAC_RESET, 0x00
.equ	PIO_SM0_CLKDIV_FRAC_BITS, 0x0000ff00
.equ	PIO_SM0_CLKDIV_FRAC_MSB, 15
.equ	PIO_SM0_CLKDIV_FRAC_LSB, 8
# =============================================================================
# Register    : PIO_SM0_EXECCTRL
# Description : Execution/behavioural settings for state machine 0
.equ	PIO_SM0_EXECCTRL_OFFSET, 0x000000cc
.equ	PIO_SM0_EXECCTRL_BITS, 0xffffffff
.equ	PIO_SM0_EXECCTRL_RESET, 0x0001f000
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_EXEC_STALLED
# Description : If 1, an instruction written to SMx_INSTR is stalled, and
#               latched by the state machine. Will clear to 0 once this
#               instruction completes.
.equ	PIO_SM0_EXECCTRL_EXEC_STALLED_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_EXEC_STALLED_BITS, 0x80000000
.equ	PIO_SM0_EXECCTRL_EXEC_STALLED_MSB, 31
.equ	PIO_SM0_EXECCTRL_EXEC_STALLED_LSB, 31
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_SIDE_EN
# Description : If 1, the MSB of the Delay/Side-set instruction field is used
#               as side-set enable, rather than a side-set data bit. This
#               allows instructions to perform side-set optionally, rather than
#               on every instruction, but the maximum possible side-set width
#               is reduced from 5 to 4. Note that the value of
#               PINCTRL_SIDESET_COUNT is inclusive of this enable bit.
.equ	PIO_SM0_EXECCTRL_SIDE_EN_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_SIDE_EN_BITS, 0x40000000
.equ	PIO_SM0_EXECCTRL_SIDE_EN_MSB, 30
.equ	PIO_SM0_EXECCTRL_SIDE_EN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_SIDE_PINDIR
# Description : If 1, side-set data is asserted to pin directions, instead of
#               pin values
.equ	PIO_SM0_EXECCTRL_SIDE_PINDIR_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_SIDE_PINDIR_BITS, 0x20000000
.equ	PIO_SM0_EXECCTRL_SIDE_PINDIR_MSB, 29
.equ	PIO_SM0_EXECCTRL_SIDE_PINDIR_LSB, 29
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_JMP_PIN
# Description : The GPIO number to use as condition for JMP PIN. Unaffected by
#               input mapping.
.equ	PIO_SM0_EXECCTRL_JMP_PIN_RESET, 0x00
.equ	PIO_SM0_EXECCTRL_JMP_PIN_BITS, 0x1f000000
.equ	PIO_SM0_EXECCTRL_JMP_PIN_MSB, 28
.equ	PIO_SM0_EXECCTRL_JMP_PIN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_OUT_EN_SEL
# Description : Which data bit to use for inline OUT enable
.equ	PIO_SM0_EXECCTRL_OUT_EN_SEL_RESET, 0x00
.equ	PIO_SM0_EXECCTRL_OUT_EN_SEL_BITS, 0x00f80000
.equ	PIO_SM0_EXECCTRL_OUT_EN_SEL_MSB, 23
.equ	PIO_SM0_EXECCTRL_OUT_EN_SEL_LSB, 19
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_INLINE_OUT_EN
# Description : If 1, use a bit of OUT data as an auxiliary write enable
#               When used in conjunction with OUT_STICKY, writes with an enable
#               of 0 will
#               deassert the latest pin write. This can create useful
#               masking/override behaviour
#               due to the priority ordering of state machine pin writes (SM0 <
#               SM1 < ...)
.equ	PIO_SM0_EXECCTRL_INLINE_OUT_EN_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_INLINE_OUT_EN_BITS, 0x00040000
.equ	PIO_SM0_EXECCTRL_INLINE_OUT_EN_MSB, 18
.equ	PIO_SM0_EXECCTRL_INLINE_OUT_EN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_OUT_STICKY
# Description : Continuously assert the most recent OUT/SET to the pins
.equ	PIO_SM0_EXECCTRL_OUT_STICKY_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_OUT_STICKY_BITS, 0x00020000
.equ	PIO_SM0_EXECCTRL_OUT_STICKY_MSB, 17
.equ	PIO_SM0_EXECCTRL_OUT_STICKY_LSB, 17
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_WRAP_TOP
# Description : After reaching this address, execution is wrapped to
#               wrap_bottom.
#               If the instruction is a jump, and the jump condition is true,
#               the jump takes priority.
.equ	PIO_SM0_EXECCTRL_WRAP_TOP_RESET, 0x1f
.equ	PIO_SM0_EXECCTRL_WRAP_TOP_BITS, 0x0001f000
.equ	PIO_SM0_EXECCTRL_WRAP_TOP_MSB, 16
.equ	PIO_SM0_EXECCTRL_WRAP_TOP_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_WRAP_BOTTOM
# Description : After reaching wrap_top, execution is wrapped to this address.
.equ	PIO_SM0_EXECCTRL_WRAP_BOTTOM_RESET, 0x00
.equ	PIO_SM0_EXECCTRL_WRAP_BOTTOM_BITS, 0x00000f80
.equ	PIO_SM0_EXECCTRL_WRAP_BOTTOM_MSB, 11
.equ	PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_STATUS_SEL
# Description : Comparison used for the MOV x, STATUS instruction.
#               0x0 -> All-ones if TX FIFO level < N, otherwise all-zeroes
#               0x1 -> All-ones if RX FIFO level < N, otherwise all-zeroes
#               0x2 -> All-ones if the indexed IRQ flag is raised, otherwise all-zeroes
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_RESET, 0x0
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_BITS, 0x00000060
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_MSB, 6
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_LSB, 5
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL, 0x0
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL, 0x1
.equ	PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_IRQ, 0x2
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_EXECCTRL_STATUS_N
# Description : Comparison level or IRQ index for the MOV x, STATUS
#               instruction.
#
#               If STATUS_SEL is TXLEVEL or RXLEVEL, then values of STATUS_N
#               greater than the current FIFO depth are reserved, and have
#               undefined behaviour.
#               0x00 -> Index 0-7 of an IRQ flag in this PIO block
#               0x08 -> Index 0-7 of an IRQ flag in the next lower-numbered PIO block
#               0x10 -> Index 0-7 of an IRQ flag in the next higher-numbered PIO block
.equ	PIO_SM0_EXECCTRL_STATUS_N_RESET, 0x00
.equ	PIO_SM0_EXECCTRL_STATUS_N_BITS, 0x0000001f
.equ	PIO_SM0_EXECCTRL_STATUS_N_MSB, 4
.equ	PIO_SM0_EXECCTRL_STATUS_N_LSB, 0
.equ	PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ, 0x00
.equ	PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO, 0x08
.equ	PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO, 0x10
# =============================================================================
# Register    : PIO_SM0_SHIFTCTRL
# Description : Control behaviour of the input/output shift registers for state
#               machine 0
.equ	PIO_SM0_SHIFTCTRL_OFFSET, 0x000000d0
.equ	PIO_SM0_SHIFTCTRL_BITS, 0xffffc01f
.equ	PIO_SM0_SHIFTCTRL_RESET, 0x000c0000
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_FJOIN_RX
# Description : When 1, RX FIFO steals the TX FIFO's storage, and becomes twice
#               as deep.
#               TX FIFO is disabled as a result (always reads as both full and
#               empty).
#               FIFOs are flushed when this bit is changed.
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_RESET, 0x0
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_BITS, 0x80000000
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_MSB, 31
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_LSB, 31
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_FJOIN_TX
# Description : When 1, TX FIFO steals the RX FIFO's storage, and becomes twice
#               as deep.
#               RX FIFO is disabled as a result (always reads as both full and
#               empty).
#               FIFOs are flushed when this bit is changed.
.equ	PIO_SM0_SHIFTCTRL_FJOIN_TX_RESET, 0x0
.equ	PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS, 0x40000000
.equ	PIO_SM0_SHIFTCTRL_FJOIN_TX_MSB, 30
.equ	PIO_SM0_SHIFTCTRL_FJOIN_TX_LSB, 30
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_PULL_THRESH
# Description : Number of bits shifted out of OSR before autopull, or
#               conditional pull (PULL IFEMPTY), will take place.
#               Write 0 for value of 32.
.equ	PIO_SM0_SHIFTCTRL_PULL_THRESH_RESET, 0x00
.equ	PIO_SM0_SHIFTCTRL_PULL_THRESH_BITS, 0x3e000000
.equ	PIO_SM0_SHIFTCTRL_PULL_THRESH_MSB, 29
.equ	PIO_SM0_SHIFTCTRL_PULL_THRESH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_PUSH_THRESH
# Description : Number of bits shifted into ISR before autopush, or conditional
#               push (PUSH IFFULL), will take place.
#               Write 0 for value of 32.
.equ	PIO_SM0_SHIFTCTRL_PUSH_THRESH_RESET, 0x00
.equ	PIO_SM0_SHIFTCTRL_PUSH_THRESH_BITS, 0x01f00000
.equ	PIO_SM0_SHIFTCTRL_PUSH_THRESH_MSB, 24
.equ	PIO_SM0_SHIFTCTRL_PUSH_THRESH_LSB, 20
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR
# Description : 1 = shift out of output shift register to right. 0 = to left.
.equ	PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_RESET, 0x1
.equ	PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_BITS, 0x00080000
.equ	PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_MSB, 19
.equ	PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_LSB, 19
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_IN_SHIFTDIR
# Description : 1 = shift input shift register to right (data enters from
#               left). 0 = to left.
.equ	PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_RESET, 0x1
.equ	PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_BITS, 0x00040000
.equ	PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_MSB, 18
.equ	PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_LSB, 18
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_AUTOPULL
# Description : Pull automatically when the output shift register is emptied,
#               i.e. on or following an OUT instruction which causes the output
#               shift counter to reach or exceed PULL_THRESH.
.equ	PIO_SM0_SHIFTCTRL_AUTOPULL_RESET, 0x0
.equ	PIO_SM0_SHIFTCTRL_AUTOPULL_BITS, 0x00020000
.equ	PIO_SM0_SHIFTCTRL_AUTOPULL_MSB, 17
.equ	PIO_SM0_SHIFTCTRL_AUTOPULL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_AUTOPUSH
# Description : Push automatically when the input shift register is filled,
#               i.e. on an IN instruction which causes the input shift counter
#               to reach or exceed PUSH_THRESH.
.equ	PIO_SM0_SHIFTCTRL_AUTOPUSH_RESET, 0x0
.equ	PIO_SM0_SHIFTCTRL_AUTOPUSH_BITS, 0x00010000
.equ	PIO_SM0_SHIFTCTRL_AUTOPUSH_MSB, 16
.equ	PIO_SM0_SHIFTCTRL_AUTOPUSH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT
# Description : If 1, disable this state machine's RX FIFO, make its storage
#               available for random write access by the state machine (using
#               the `put` instruction) and, unless FJOIN_RX_GET is also set,
#               random read access by the processor (through the RXFx_PUTGETy
#               registers).
#
#               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
#               FIFO's registers can be randomly read/written by the state
#               machine, but are completely inaccessible to the processor.
#
#               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_RESET, 0x0
