konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pio.inc
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_BITS, 0x00008000
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_MSB, 15
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_FJOIN_RX_GET
# Description : If 1, disable this state machine's RX FIFO, make its storage
#               available for random read access by the state machine (using
#               the `get` instruction) and, unless FJOIN_RX_PUT is also set,
#               random write access by the processor (through the RXFx_PUTGETy
#               registers).
#
#               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
#               FIFO's registers can be randomly read/written by the state
#               machine, but are completely inaccessible to the processor.
#
#               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_RESET, 0x0
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_BITS, 0x00004000
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_MSB, 14
.equ	PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_SHIFTCTRL_IN_COUNT
# Description : Set the number of pins which are not masked to 0 when read by
#               an IN PINS, WAIT PIN or MOV x, PINS instruction.
#
#               For example, an IN_COUNT of 5 means that the 5 LSBs of the IN
#               pin group are visible (bits 4:0), but the remaining 27 MSBs are
#               masked to 0. A count of 32 is encoded with a field value of 0,
#               so the default behaviour is to not perform any masking.
#
#               Note this masking is applied in addition to the masking usually
#               performed by the IN instruction. This is mainly useful for the
#               MOV x, PINS instruction, which otherwise has no way of masking
#               pins.
.equ	PIO_SM0_SHIFTCTRL_IN_COUNT_RESET, 0x00
.equ	PIO_SM0_SHIFTCTRL_IN_COUNT_BITS, 0x0000001f
.equ	PIO_SM0_SHIFTCTRL_IN_COUNT_MSB, 4
.equ	PIO_SM0_SHIFTCTRL_IN_COUNT_LSB, 0
# =============================================================================
# Register    : PIO_SM0_ADDR
# Description : Current instruction address of state machine 0
.equ	PIO_SM0_ADDR_OFFSET, 0x000000d4
.equ	PIO_SM0_ADDR_BITS, 0x0000001f
.equ	PIO_SM0_ADDR_RESET, 0x00000000
.equ	PIO_SM0_ADDR_MSB, 4
.equ	PIO_SM0_ADDR_LSB, 0
# =============================================================================
# Register    : PIO_SM0_INSTR
# Description : Read to see the instruction currently addressed by state
#               machine 0's program counter
#               Write to execute an instruction immediately (including jumps)
#               and then resume execution.
.equ	PIO_SM0_INSTR_OFFSET, 0x000000d8
.equ	PIO_SM0_INSTR_BITS, 0x0000ffff
.equ	PIO_SM0_INSTR_MSB, 15
.equ	PIO_SM0_INSTR_LSB, 0
# =============================================================================
# Register    : PIO_SM0_PINCTRL
# Description : State machine pin control
.equ	PIO_SM0_PINCTRL_OFFSET, 0x000000dc
.equ	PIO_SM0_PINCTRL_BITS, 0xffffffff
.equ	PIO_SM0_PINCTRL_RESET, 0x14000000
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_SIDESET_COUNT
# Description : The number of MSBs of the Delay/Side-set instruction field
#               which are used for side-set. Inclusive of the enable bit, if
#               present. Minimum of 0 (all delay bits, no side-set) and maximum
#               of 5 (all side-set, no delay).
.equ	PIO_SM0_PINCTRL_SIDESET_COUNT_RESET, 0x0
.equ	PIO_SM0_PINCTRL_SIDESET_COUNT_BITS, 0xe0000000
.equ	PIO_SM0_PINCTRL_SIDESET_COUNT_MSB, 31
.equ	PIO_SM0_PINCTRL_SIDESET_COUNT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_SET_COUNT
# Description : The number of pins asserted by a SET. In the range 0 to 5
#               inclusive.
.equ	PIO_SM0_PINCTRL_SET_COUNT_RESET, 0x5
.equ	PIO_SM0_PINCTRL_SET_COUNT_BITS, 0x1c000000
.equ	PIO_SM0_PINCTRL_SET_COUNT_MSB, 28
.equ	PIO_SM0_PINCTRL_SET_COUNT_LSB, 26
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_OUT_COUNT
# Description : The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
#               PINS instruction. In the range 0 to 32 inclusive.
.equ	PIO_SM0_PINCTRL_OUT_COUNT_RESET, 0x00
.equ	PIO_SM0_PINCTRL_OUT_COUNT_BITS, 0x03f00000
.equ	PIO_SM0_PINCTRL_OUT_COUNT_MSB, 25
.equ	PIO_SM0_PINCTRL_OUT_COUNT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_IN_BASE
# Description : The pin which is mapped to the least-significant bit of a state
#               machine's IN data bus. Higher-numbered pins are mapped to
#               consecutively more-significant data bits, with a modulo of 32
#               applied to pin number.
.equ	PIO_SM0_PINCTRL_IN_BASE_RESET, 0x00
.equ	PIO_SM0_PINCTRL_IN_BASE_BITS, 0x000f8000
.equ	PIO_SM0_PINCTRL_IN_BASE_MSB, 19
.equ	PIO_SM0_PINCTRL_IN_BASE_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_SIDESET_BASE
# Description : The lowest-numbered pin that will be affected by a side-set
#               operation. The MSBs of an instruction's side-set/delay field
#               (up to 5, determined by SIDESET_COUNT) are used for side-set
#               data, with the remaining LSBs used for delay. The least-
#               significant bit of the side-set portion is the bit written to
#               this pin, with more-significant bits written to higher-numbered
#               pins.
.equ	PIO_SM0_PINCTRL_SIDESET_BASE_RESET, 0x00
.equ	PIO_SM0_PINCTRL_SIDESET_BASE_BITS, 0x00007c00
.equ	PIO_SM0_PINCTRL_SIDESET_BASE_MSB, 14
.equ	PIO_SM0_PINCTRL_SIDESET_BASE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_SET_BASE
# Description : The lowest-numbered pin that will be affected by a SET PINS or
#               SET PINDIRS instruction. The data written to this pin is the
#               least-significant bit of the SET data.
.equ	PIO_SM0_PINCTRL_SET_BASE_RESET, 0x00
.equ	PIO_SM0_PINCTRL_SET_BASE_BITS, 0x000003e0
.equ	PIO_SM0_PINCTRL_SET_BASE_MSB, 9
.equ	PIO_SM0_PINCTRL_SET_BASE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_SM0_PINCTRL_OUT_BASE
# Description : The lowest-numbered pin that will be affected by an OUT PINS,
#               OUT PINDIRS or MOV PINS instruction. The data written to this
#               pin will always be the least-significant bit of the OUT or MOV
#               data.
.equ	PIO_SM0_PINCTRL_OUT_BASE_RESET, 0x00
.equ	PIO_SM0_PINCTRL_OUT_BASE_BITS, 0x0000001f
.equ	PIO_SM0_PINCTRL_OUT_BASE_MSB, 4
.equ	PIO_SM0_PINCTRL_OUT_BASE_LSB, 0
# =============================================================================
# Register    : PIO_SM1_CLKDIV
# Description : Clock divisor register for state machine 1
#               Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)
.equ	PIO_SM1_CLKDIV_OFFSET, 0x000000e0
.equ	PIO_SM1_CLKDIV_BITS, 0xffffff00
.equ	PIO_SM1_CLKDIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_CLKDIV_INT
# Description : Effective frequency is sysclk/(int + frac/256).
#               Value of 0 is interpreted as 65536. If INT is 0, FRAC must also
#               be 0.
.equ	PIO_SM1_CLKDIV_INT_RESET, 0x0001
.equ	PIO_SM1_CLKDIV_INT_BITS, 0xffff0000
.equ	PIO_SM1_CLKDIV_INT_MSB, 31
.equ	PIO_SM1_CLKDIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_CLKDIV_FRAC
# Description : Fractional part of clock divisor
.equ	PIO_SM1_CLKDIV_FRAC_RESET, 0x00
.equ	PIO_SM1_CLKDIV_FRAC_BITS, 0x0000ff00
.equ	PIO_SM1_CLKDIV_FRAC_MSB, 15
.equ	PIO_SM1_CLKDIV_FRAC_LSB, 8
# =============================================================================
# Register    : PIO_SM1_EXECCTRL
# Description : Execution/behavioural settings for state machine 1
.equ	PIO_SM1_EXECCTRL_OFFSET, 0x000000e4
.equ	PIO_SM1_EXECCTRL_BITS, 0xffffffff
.equ	PIO_SM1_EXECCTRL_RESET, 0x0001f000
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_EXEC_STALLED
# Description : If 1, an instruction written to SMx_INSTR is stalled, and
#               latched by the state machine. Will clear to 0 once this
#               instruction completes.
.equ	PIO_SM1_EXECCTRL_EXEC_STALLED_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_EXEC_STALLED_BITS, 0x80000000
.equ	PIO_SM1_EXECCTRL_EXEC_STALLED_MSB, 31
.equ	PIO_SM1_EXECCTRL_EXEC_STALLED_LSB, 31
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_SIDE_EN
# Description : If 1, the MSB of the Delay/Side-set instruction field is used
#               as side-set enable, rather than a side-set data bit. This
#               allows instructions to perform side-set optionally, rather than
#               on every instruction, but the maximum possible side-set width
#               is reduced from 5 to 4. Note that the value of
#               PINCTRL_SIDESET_COUNT is inclusive of this enable bit.
.equ	PIO_SM1_EXECCTRL_SIDE_EN_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_SIDE_EN_BITS, 0x40000000
.equ	PIO_SM1_EXECCTRL_SIDE_EN_MSB, 30
.equ	PIO_SM1_EXECCTRL_SIDE_EN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_SIDE_PINDIR
# Description : If 1, side-set data is asserted to pin directions, instead of
#               pin values
.equ	PIO_SM1_EXECCTRL_SIDE_PINDIR_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_SIDE_PINDIR_BITS, 0x20000000
.equ	PIO_SM1_EXECCTRL_SIDE_PINDIR_MSB, 29
.equ	PIO_SM1_EXECCTRL_SIDE_PINDIR_LSB, 29
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_JMP_PIN
# Description : The GPIO number to use as condition for JMP PIN. Unaffected by
#               input mapping.
.equ	PIO_SM1_EXECCTRL_JMP_PIN_RESET, 0x00
.equ	PIO_SM1_EXECCTRL_JMP_PIN_BITS, 0x1f000000
.equ	PIO_SM1_EXECCTRL_JMP_PIN_MSB, 28
.equ	PIO_SM1_EXECCTRL_JMP_PIN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_OUT_EN_SEL
# Description : Which data bit to use for inline OUT enable
.equ	PIO_SM1_EXECCTRL_OUT_EN_SEL_RESET, 0x00
.equ	PIO_SM1_EXECCTRL_OUT_EN_SEL_BITS, 0x00f80000
.equ	PIO_SM1_EXECCTRL_OUT_EN_SEL_MSB, 23
.equ	PIO_SM1_EXECCTRL_OUT_EN_SEL_LSB, 19
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_INLINE_OUT_EN
# Description : If 1, use a bit of OUT data as an auxiliary write enable
#               When used in conjunction with OUT_STICKY, writes with an enable
#               of 0 will
#               deassert the latest pin write. This can create useful
#               masking/override behaviour
#               due to the priority ordering of state machine pin writes (SM0 <
#               SM1 < ...)
.equ	PIO_SM1_EXECCTRL_INLINE_OUT_EN_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_INLINE_OUT_EN_BITS, 0x00040000
.equ	PIO_SM1_EXECCTRL_INLINE_OUT_EN_MSB, 18
.equ	PIO_SM1_EXECCTRL_INLINE_OUT_EN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_OUT_STICKY
# Description : Continuously assert the most recent OUT/SET to the pins
.equ	PIO_SM1_EXECCTRL_OUT_STICKY_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_OUT_STICKY_BITS, 0x00020000
.equ	PIO_SM1_EXECCTRL_OUT_STICKY_MSB, 17
.equ	PIO_SM1_EXECCTRL_OUT_STICKY_LSB, 17
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_WRAP_TOP
# Description : After reaching this address, execution is wrapped to
#               wrap_bottom.
#               If the instruction is a jump, and the jump condition is true,
#               the jump takes priority.
.equ	PIO_SM1_EXECCTRL_WRAP_TOP_RESET, 0x1f
.equ	PIO_SM1_EXECCTRL_WRAP_TOP_BITS, 0x0001f000
.equ	PIO_SM1_EXECCTRL_WRAP_TOP_MSB, 16
.equ	PIO_SM1_EXECCTRL_WRAP_TOP_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_WRAP_BOTTOM
# Description : After reaching wrap_top, execution is wrapped to this address.
.equ	PIO_SM1_EXECCTRL_WRAP_BOTTOM_RESET, 0x00
.equ	PIO_SM1_EXECCTRL_WRAP_BOTTOM_BITS, 0x00000f80
.equ	PIO_SM1_EXECCTRL_WRAP_BOTTOM_MSB, 11
.equ	PIO_SM1_EXECCTRL_WRAP_BOTTOM_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_STATUS_SEL
# Description : Comparison used for the MOV x, STATUS instruction.
#               0x0 -> All-ones if TX FIFO level < N, otherwise all-zeroes
#               0x1 -> All-ones if RX FIFO level < N, otherwise all-zeroes
#               0x2 -> All-ones if the indexed IRQ flag is raised, otherwise all-zeroes
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_RESET, 0x0
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_BITS, 0x00000060
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_MSB, 6
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_LSB, 5
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL, 0x0
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL, 0x1
.equ	PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_IRQ, 0x2
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_EXECCTRL_STATUS_N
# Description : Comparison level or IRQ index for the MOV x, STATUS
#               instruction.
#
#               If STATUS_SEL is TXLEVEL or RXLEVEL, then values of STATUS_N
#               greater than the current FIFO depth are reserved, and have
#               undefined behaviour.
#               0x00 -> Index 0-7 of an IRQ flag in this PIO block
#               0x08 -> Index 0-7 of an IRQ flag in the next lower-numbered PIO block
#               0x10 -> Index 0-7 of an IRQ flag in the next higher-numbered PIO block
.equ	PIO_SM1_EXECCTRL_STATUS_N_RESET, 0x00
.equ	PIO_SM1_EXECCTRL_STATUS_N_BITS, 0x0000001f
.equ	PIO_SM1_EXECCTRL_STATUS_N_MSB, 4
.equ	PIO_SM1_EXECCTRL_STATUS_N_LSB, 0
.equ	PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ, 0x00
.equ	PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO, 0x08
.equ	PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO, 0x10
# =============================================================================
# Register    : PIO_SM1_SHIFTCTRL
# Description : Control behaviour of the input/output shift registers for state
#               machine 1
.equ	PIO_SM1_SHIFTCTRL_OFFSET, 0x000000e8
.equ	PIO_SM1_SHIFTCTRL_BITS, 0xffffc01f
.equ	PIO_SM1_SHIFTCTRL_RESET, 0x000c0000
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_FJOIN_RX
# Description : When 1, RX FIFO steals the TX FIFO's storage, and becomes twice
#               as deep.
#               TX FIFO is disabled as a result (always reads as both full and
#               empty).
#               FIFOs are flushed when this bit is changed.
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_BITS, 0x80000000
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_MSB, 31
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_LSB, 31
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_FJOIN_TX
# Description : When 1, TX FIFO steals the RX FIFO's storage, and becomes twice
#               as deep.
#               RX FIFO is disabled as a result (always reads as both full and
#               empty).
#               FIFOs are flushed when this bit is changed.
.equ	PIO_SM1_SHIFTCTRL_FJOIN_TX_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_FJOIN_TX_BITS, 0x40000000
.equ	PIO_SM1_SHIFTCTRL_FJOIN_TX_MSB, 30
.equ	PIO_SM1_SHIFTCTRL_FJOIN_TX_LSB, 30
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_PULL_THRESH
# Description : Number of bits shifted out of OSR before autopull, or
#               conditional pull (PULL IFEMPTY), will take place.
#               Write 0 for value of 32.
.equ	PIO_SM1_SHIFTCTRL_PULL_THRESH_RESET, 0x00
.equ	PIO_SM1_SHIFTCTRL_PULL_THRESH_BITS, 0x3e000000
.equ	PIO_SM1_SHIFTCTRL_PULL_THRESH_MSB, 29
.equ	PIO_SM1_SHIFTCTRL_PULL_THRESH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_PUSH_THRESH
# Description : Number of bits shifted into ISR before autopush, or conditional
#               push (PUSH IFFULL), will take place.
#               Write 0 for value of 32.
.equ	PIO_SM1_SHIFTCTRL_PUSH_THRESH_RESET, 0x00
.equ	PIO_SM1_SHIFTCTRL_PUSH_THRESH_BITS, 0x01f00000
.equ	PIO_SM1_SHIFTCTRL_PUSH_THRESH_MSB, 24
.equ	PIO_SM1_SHIFTCTRL_PUSH_THRESH_LSB, 20
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR
# Description : 1 = shift out of output shift register to right. 0 = to left.
.equ	PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_RESET, 0x1
.equ	PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_BITS, 0x00080000
.equ	PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_MSB, 19
.equ	PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_LSB, 19
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_IN_SHIFTDIR
# Description : 1 = shift input shift register to right (data enters from
#               left). 0 = to left.
.equ	PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_RESET, 0x1
.equ	PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_BITS, 0x00040000
.equ	PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_MSB, 18
.equ	PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_LSB, 18
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_AUTOPULL
# Description : Pull automatically when the output shift register is emptied,
#               i.e. on or following an OUT instruction which causes the output
#               shift counter to reach or exceed PULL_THRESH.
.equ	PIO_SM1_SHIFTCTRL_AUTOPULL_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_AUTOPULL_BITS, 0x00020000
.equ	PIO_SM1_SHIFTCTRL_AUTOPULL_MSB, 17
.equ	PIO_SM1_SHIFTCTRL_AUTOPULL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_AUTOPUSH
# Description : Push automatically when the input shift register is filled,
#               i.e. on an IN instruction which causes the input shift counter
#               to reach or exceed PUSH_THRESH.
.equ	PIO_SM1_SHIFTCTRL_AUTOPUSH_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_AUTOPUSH_BITS, 0x00010000
.equ	PIO_SM1_SHIFTCTRL_AUTOPUSH_MSB, 16
.equ	PIO_SM1_SHIFTCTRL_AUTOPUSH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT
# Description : If 1, disable this state machine's RX FIFO, make its storage
#               available for random write access by the state machine (using
#               the `put` instruction) and, unless FJOIN_RX_GET is also set,
#               random read access by the processor (through the RXFx_PUTGETy
#               registers).
#
#               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
#               FIFO's registers can be randomly read/written by the state
#               machine, but are completely inaccessible to the processor.
#
#               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_BITS, 0x00008000
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_MSB, 15
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_FJOIN_RX_GET
# Description : If 1, disable this state machine's RX FIFO, make its storage
#               available for random read access by the state machine (using
#               the `get` instruction) and, unless FJOIN_RX_PUT is also set,
#               random write access by the processor (through the RXFx_PUTGETy
#               registers).
#
#               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
#               FIFO's registers can be randomly read/written by the state
#               machine, but are completely inaccessible to the processor.
#
#               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_RESET, 0x0
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_BITS, 0x00004000
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_MSB, 14
.equ	PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_SHIFTCTRL_IN_COUNT
# Description : Set the number of pins which are not masked to 0 when read by
#               an IN PINS, WAIT PIN or MOV x, PINS instruction.
#
#               For example, an IN_COUNT of 5 means that the 5 LSBs of the IN
#               pin group are visible (bits 4:0), but the remaining 27 MSBs are
#               masked to 0. A count of 32 is encoded with a field value of 0,
#               so the default behaviour is to not perform any masking.
#
#               Note this masking is applied in addition to the masking usually
#               performed by the IN instruction. This is mainly useful for the
#               MOV x, PINS instruction, which otherwise has no way of masking
#               pins.
.equ	PIO_SM1_SHIFTCTRL_IN_COUNT_RESET, 0x00
.equ	PIO_SM1_SHIFTCTRL_IN_COUNT_BITS, 0x0000001f
.equ	PIO_SM1_SHIFTCTRL_IN_COUNT_MSB, 4
.equ	PIO_SM1_SHIFTCTRL_IN_COUNT_LSB, 0
# =============================================================================
# Register    : PIO_SM1_ADDR
# Description : Current instruction address of state machine 1
.equ	PIO_SM1_ADDR_OFFSET, 0x000000ec
.equ	PIO_SM1_ADDR_BITS, 0x0000001f
.equ	PIO_SM1_ADDR_RESET, 0x00000000
.equ	PIO_SM1_ADDR_MSB, 4
.equ	PIO_SM1_ADDR_LSB, 0
# =============================================================================
# Register    : PIO_SM1_INSTR
# Description : Read to see the instruction currently addressed by state
#               machine 1's program counter
#               Write to execute an instruction immediately (including jumps)
#               and then resume execution.
.equ	PIO_SM1_INSTR_OFFSET, 0x000000f0
.equ	PIO_SM1_INSTR_BITS, 0x0000ffff
.equ	PIO_SM1_INSTR_MSB, 15
.equ	PIO_SM1_INSTR_LSB, 0
# =============================================================================
# Register    : PIO_SM1_PINCTRL
# Description : State machine pin control
.equ	PIO_SM1_PINCTRL_OFFSET, 0x000000f4
.equ	PIO_SM1_PINCTRL_BITS, 0xffffffff
.equ	PIO_SM1_PINCTRL_RESET, 0x14000000
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_PINCTRL_SIDESET_COUNT
# Description : The number of MSBs of the Delay/Side-set instruction field
#               which are used for side-set. Inclusive of the enable bit, if
#               present. Minimum of 0 (all delay bits, no side-set) and maximum
#               of 5 (all side-set, no delay).
.equ	PIO_SM1_PINCTRL_SIDESET_COUNT_RESET, 0x0
.equ	PIO_SM1_PINCTRL_SIDESET_COUNT_BITS, 0xe0000000
.equ	PIO_SM1_PINCTRL_SIDESET_COUNT_MSB, 31
.equ	PIO_SM1_PINCTRL_SIDESET_COUNT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_PINCTRL_SET_COUNT
# Description : The number of pins asserted by a SET. In the range 0 to 5
#               inclusive.
.equ	PIO_SM1_PINCTRL_SET_COUNT_RESET, 0x5
.equ	PIO_SM1_PINCTRL_SET_COUNT_BITS, 0x1c000000
.equ	PIO_SM1_PINCTRL_SET_COUNT_MSB, 28
.equ	PIO_SM1_PINCTRL_SET_COUNT_LSB, 26
# -----------------------------------------------------------------------------
# Field       : PIO_SM1_PINCTRL_OUT_COUNT
# Description : The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
#               PINS instruction. In the range 0 to 32 inclusive.
