konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pio.inc
#               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
.equ	PIO_RXF3_PUTGET2_OFFSET, 0x00000160
.equ	PIO_RXF3_PUTGET2_BITS, 0xffffffff
.equ	PIO_RXF3_PUTGET2_RESET, 0x00000000
.equ	PIO_RXF3_PUTGET2_MSB, 31
.equ	PIO_RXF3_PUTGET2_LSB, 0
# =============================================================================
# Register    : PIO_RXF3_PUTGET3
# Description : Direct read/write access to entry 3 of SM3's RX FIFO, if
#               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
.equ	PIO_RXF3_PUTGET3_OFFSET, 0x00000164
.equ	PIO_RXF3_PUTGET3_BITS, 0xffffffff
.equ	PIO_RXF3_PUTGET3_RESET, 0x00000000
.equ	PIO_RXF3_PUTGET3_MSB, 31
.equ	PIO_RXF3_PUTGET3_LSB, 0
# =============================================================================
# Register    : PIO_GPIOBASE
# Description : Relocate GPIO 0 (from PIO's point of view) in the system GPIO
#               numbering, to access more than 32 GPIOs from PIO.
#
#               Only the values 0 and 16 are supported (only bit 4 is
#               writable).
.equ	PIO_GPIOBASE_OFFSET, 0x00000168
.equ	PIO_GPIOBASE_BITS, 0x00000010
.equ	PIO_GPIOBASE_RESET, 0x00000000
.equ	PIO_GPIOBASE_MSB, 4
.equ	PIO_GPIOBASE_LSB, 4
# =============================================================================
# Register    : PIO_INTR
# Description : Raw Interrupts
.equ	PIO_INTR_OFFSET, 0x0000016c
.equ	PIO_INTR_BITS, 0x0000ffff
.equ	PIO_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM7
.equ	PIO_INTR_SM7_RESET, 0x0
.equ	PIO_INTR_SM7_BITS, 0x00008000
.equ	PIO_INTR_SM7_MSB, 15
.equ	PIO_INTR_SM7_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM6
.equ	PIO_INTR_SM6_RESET, 0x0
.equ	PIO_INTR_SM6_BITS, 0x00004000
.equ	PIO_INTR_SM6_MSB, 14
.equ	PIO_INTR_SM6_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM5
.equ	PIO_INTR_SM5_RESET, 0x0
.equ	PIO_INTR_SM5_BITS, 0x00002000
.equ	PIO_INTR_SM5_MSB, 13
.equ	PIO_INTR_SM5_LSB, 13
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM4
.equ	PIO_INTR_SM4_RESET, 0x0
.equ	PIO_INTR_SM4_BITS, 0x00001000
.equ	PIO_INTR_SM4_MSB, 12
.equ	PIO_INTR_SM4_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM3
.equ	PIO_INTR_SM3_RESET, 0x0
.equ	PIO_INTR_SM3_BITS, 0x00000800
.equ	PIO_INTR_SM3_MSB, 11
.equ	PIO_INTR_SM3_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM2
.equ	PIO_INTR_SM2_RESET, 0x0
.equ	PIO_INTR_SM2_BITS, 0x00000400
.equ	PIO_INTR_SM2_MSB, 10
.equ	PIO_INTR_SM2_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM1
.equ	PIO_INTR_SM1_RESET, 0x0
.equ	PIO_INTR_SM1_BITS, 0x00000200
.equ	PIO_INTR_SM1_MSB, 9
.equ	PIO_INTR_SM1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM0
.equ	PIO_INTR_SM0_RESET, 0x0
.equ	PIO_INTR_SM0_BITS, 0x00000100
.equ	PIO_INTR_SM0_MSB, 8
.equ	PIO_INTR_SM0_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM3_TXNFULL
.equ	PIO_INTR_SM3_TXNFULL_RESET, 0x0
.equ	PIO_INTR_SM3_TXNFULL_BITS, 0x00000080
.equ	PIO_INTR_SM3_TXNFULL_MSB, 7
.equ	PIO_INTR_SM3_TXNFULL_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM2_TXNFULL
.equ	PIO_INTR_SM2_TXNFULL_RESET, 0x0
.equ	PIO_INTR_SM2_TXNFULL_BITS, 0x00000040
.equ	PIO_INTR_SM2_TXNFULL_MSB, 6
.equ	PIO_INTR_SM2_TXNFULL_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM1_TXNFULL
.equ	PIO_INTR_SM1_TXNFULL_RESET, 0x0
.equ	PIO_INTR_SM1_TXNFULL_BITS, 0x00000020
.equ	PIO_INTR_SM1_TXNFULL_MSB, 5
.equ	PIO_INTR_SM1_TXNFULL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM0_TXNFULL
.equ	PIO_INTR_SM0_TXNFULL_RESET, 0x0
.equ	PIO_INTR_SM0_TXNFULL_BITS, 0x00000010
.equ	PIO_INTR_SM0_TXNFULL_MSB, 4
.equ	PIO_INTR_SM0_TXNFULL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM3_RXNEMPTY
.equ	PIO_INTR_SM3_RXNEMPTY_RESET, 0x0
.equ	PIO_INTR_SM3_RXNEMPTY_BITS, 0x00000008
.equ	PIO_INTR_SM3_RXNEMPTY_MSB, 3
.equ	PIO_INTR_SM3_RXNEMPTY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM2_RXNEMPTY
.equ	PIO_INTR_SM2_RXNEMPTY_RESET, 0x0
.equ	PIO_INTR_SM2_RXNEMPTY_BITS, 0x00000004
.equ	PIO_INTR_SM2_RXNEMPTY_MSB, 2
.equ	PIO_INTR_SM2_RXNEMPTY_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM1_RXNEMPTY
.equ	PIO_INTR_SM1_RXNEMPTY_RESET, 0x0
.equ	PIO_INTR_SM1_RXNEMPTY_BITS, 0x00000002
.equ	PIO_INTR_SM1_RXNEMPTY_MSB, 1
.equ	PIO_INTR_SM1_RXNEMPTY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PIO_INTR_SM0_RXNEMPTY
.equ	PIO_INTR_SM0_RXNEMPTY_RESET, 0x0
.equ	PIO_INTR_SM0_RXNEMPTY_BITS, 0x00000001
.equ	PIO_INTR_SM0_RXNEMPTY_MSB, 0
.equ	PIO_INTR_SM0_RXNEMPTY_LSB, 0
# =============================================================================
# Register    : PIO_IRQ0_INTE
# Description : Interrupt Enable for irq0
.equ	PIO_IRQ0_INTE_OFFSET, 0x00000170
.equ	PIO_IRQ0_INTE_BITS, 0x0000ffff
.equ	PIO_IRQ0_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM7
.equ	PIO_IRQ0_INTE_SM7_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM7_BITS, 0x00008000
.equ	PIO_IRQ0_INTE_SM7_MSB, 15
.equ	PIO_IRQ0_INTE_SM7_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM6
.equ	PIO_IRQ0_INTE_SM6_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM6_BITS, 0x00004000
.equ	PIO_IRQ0_INTE_SM6_MSB, 14
.equ	PIO_IRQ0_INTE_SM6_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM5
.equ	PIO_IRQ0_INTE_SM5_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM5_BITS, 0x00002000
.equ	PIO_IRQ0_INTE_SM5_MSB, 13
.equ	PIO_IRQ0_INTE_SM5_LSB, 13
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM4
.equ	PIO_IRQ0_INTE_SM4_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM4_BITS, 0x00001000
.equ	PIO_IRQ0_INTE_SM4_MSB, 12
.equ	PIO_IRQ0_INTE_SM4_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM3
.equ	PIO_IRQ0_INTE_SM3_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM3_BITS, 0x00000800
.equ	PIO_IRQ0_INTE_SM3_MSB, 11
.equ	PIO_IRQ0_INTE_SM3_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM2
.equ	PIO_IRQ0_INTE_SM2_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM2_BITS, 0x00000400
.equ	PIO_IRQ0_INTE_SM2_MSB, 10
.equ	PIO_IRQ0_INTE_SM2_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM1
.equ	PIO_IRQ0_INTE_SM1_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM1_BITS, 0x00000200
.equ	PIO_IRQ0_INTE_SM1_MSB, 9
.equ	PIO_IRQ0_INTE_SM1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM0
.equ	PIO_IRQ0_INTE_SM0_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM0_BITS, 0x00000100
.equ	PIO_IRQ0_INTE_SM0_MSB, 8
.equ	PIO_IRQ0_INTE_SM0_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM3_TXNFULL
.equ	PIO_IRQ0_INTE_SM3_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM3_TXNFULL_BITS, 0x00000080
.equ	PIO_IRQ0_INTE_SM3_TXNFULL_MSB, 7
.equ	PIO_IRQ0_INTE_SM3_TXNFULL_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM2_TXNFULL
.equ	PIO_IRQ0_INTE_SM2_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM2_TXNFULL_BITS, 0x00000040
.equ	PIO_IRQ0_INTE_SM2_TXNFULL_MSB, 6
.equ	PIO_IRQ0_INTE_SM2_TXNFULL_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM1_TXNFULL
.equ	PIO_IRQ0_INTE_SM1_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM1_TXNFULL_BITS, 0x00000020
.equ	PIO_IRQ0_INTE_SM1_TXNFULL_MSB, 5
.equ	PIO_IRQ0_INTE_SM1_TXNFULL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM0_TXNFULL
.equ	PIO_IRQ0_INTE_SM0_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM0_TXNFULL_BITS, 0x00000010
.equ	PIO_IRQ0_INTE_SM0_TXNFULL_MSB, 4
.equ	PIO_IRQ0_INTE_SM0_TXNFULL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM3_RXNEMPTY
.equ	PIO_IRQ0_INTE_SM3_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM3_RXNEMPTY_BITS, 0x00000008
.equ	PIO_IRQ0_INTE_SM3_RXNEMPTY_MSB, 3
.equ	PIO_IRQ0_INTE_SM3_RXNEMPTY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM2_RXNEMPTY
.equ	PIO_IRQ0_INTE_SM2_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM2_RXNEMPTY_BITS, 0x00000004
.equ	PIO_IRQ0_INTE_SM2_RXNEMPTY_MSB, 2
.equ	PIO_IRQ0_INTE_SM2_RXNEMPTY_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM1_RXNEMPTY
.equ	PIO_IRQ0_INTE_SM1_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS, 0x00000002
.equ	PIO_IRQ0_INTE_SM1_RXNEMPTY_MSB, 1
.equ	PIO_IRQ0_INTE_SM1_RXNEMPTY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTE_SM0_RXNEMPTY
.equ	PIO_IRQ0_INTE_SM0_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTE_SM0_RXNEMPTY_BITS, 0x00000001
.equ	PIO_IRQ0_INTE_SM0_RXNEMPTY_MSB, 0
.equ	PIO_IRQ0_INTE_SM0_RXNEMPTY_LSB, 0
# =============================================================================
# Register    : PIO_IRQ0_INTF
# Description : Interrupt Force for irq0
.equ	PIO_IRQ0_INTF_OFFSET, 0x00000174
.equ	PIO_IRQ0_INTF_BITS, 0x0000ffff
.equ	PIO_IRQ0_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM7
.equ	PIO_IRQ0_INTF_SM7_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM7_BITS, 0x00008000
.equ	PIO_IRQ0_INTF_SM7_MSB, 15
.equ	PIO_IRQ0_INTF_SM7_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM6
.equ	PIO_IRQ0_INTF_SM6_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM6_BITS, 0x00004000
.equ	PIO_IRQ0_INTF_SM6_MSB, 14
.equ	PIO_IRQ0_INTF_SM6_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM5
.equ	PIO_IRQ0_INTF_SM5_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM5_BITS, 0x00002000
.equ	PIO_IRQ0_INTF_SM5_MSB, 13
.equ	PIO_IRQ0_INTF_SM5_LSB, 13
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM4
.equ	PIO_IRQ0_INTF_SM4_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM4_BITS, 0x00001000
.equ	PIO_IRQ0_INTF_SM4_MSB, 12
.equ	PIO_IRQ0_INTF_SM4_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM3
.equ	PIO_IRQ0_INTF_SM3_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM3_BITS, 0x00000800
.equ	PIO_IRQ0_INTF_SM3_MSB, 11
.equ	PIO_IRQ0_INTF_SM3_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM2
.equ	PIO_IRQ0_INTF_SM2_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM2_BITS, 0x00000400
.equ	PIO_IRQ0_INTF_SM2_MSB, 10
.equ	PIO_IRQ0_INTF_SM2_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM1
.equ	PIO_IRQ0_INTF_SM1_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM1_BITS, 0x00000200
.equ	PIO_IRQ0_INTF_SM1_MSB, 9
.equ	PIO_IRQ0_INTF_SM1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM0
.equ	PIO_IRQ0_INTF_SM0_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM0_BITS, 0x00000100
.equ	PIO_IRQ0_INTF_SM0_MSB, 8
.equ	PIO_IRQ0_INTF_SM0_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM3_TXNFULL
.equ	PIO_IRQ0_INTF_SM3_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM3_TXNFULL_BITS, 0x00000080
.equ	PIO_IRQ0_INTF_SM3_TXNFULL_MSB, 7
.equ	PIO_IRQ0_INTF_SM3_TXNFULL_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM2_TXNFULL
.equ	PIO_IRQ0_INTF_SM2_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM2_TXNFULL_BITS, 0x00000040
.equ	PIO_IRQ0_INTF_SM2_TXNFULL_MSB, 6
.equ	PIO_IRQ0_INTF_SM2_TXNFULL_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM1_TXNFULL
.equ	PIO_IRQ0_INTF_SM1_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM1_TXNFULL_BITS, 0x00000020
.equ	PIO_IRQ0_INTF_SM1_TXNFULL_MSB, 5
.equ	PIO_IRQ0_INTF_SM1_TXNFULL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM0_TXNFULL
.equ	PIO_IRQ0_INTF_SM0_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM0_TXNFULL_BITS, 0x00000010
.equ	PIO_IRQ0_INTF_SM0_TXNFULL_MSB, 4
.equ	PIO_IRQ0_INTF_SM0_TXNFULL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM3_RXNEMPTY
.equ	PIO_IRQ0_INTF_SM3_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM3_RXNEMPTY_BITS, 0x00000008
.equ	PIO_IRQ0_INTF_SM3_RXNEMPTY_MSB, 3
.equ	PIO_IRQ0_INTF_SM3_RXNEMPTY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM2_RXNEMPTY
.equ	PIO_IRQ0_INTF_SM2_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM2_RXNEMPTY_BITS, 0x00000004
.equ	PIO_IRQ0_INTF_SM2_RXNEMPTY_MSB, 2
.equ	PIO_IRQ0_INTF_SM2_RXNEMPTY_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM1_RXNEMPTY
.equ	PIO_IRQ0_INTF_SM1_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM1_RXNEMPTY_BITS, 0x00000002
.equ	PIO_IRQ0_INTF_SM1_RXNEMPTY_MSB, 1
.equ	PIO_IRQ0_INTF_SM1_RXNEMPTY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTF_SM0_RXNEMPTY
.equ	PIO_IRQ0_INTF_SM0_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTF_SM0_RXNEMPTY_BITS, 0x00000001
.equ	PIO_IRQ0_INTF_SM0_RXNEMPTY_MSB, 0
.equ	PIO_IRQ0_INTF_SM0_RXNEMPTY_LSB, 0
# =============================================================================
# Register    : PIO_IRQ0_INTS
# Description : Interrupt status after masking & forcing for irq0
.equ	PIO_IRQ0_INTS_OFFSET, 0x00000178
.equ	PIO_IRQ0_INTS_BITS, 0x0000ffff
.equ	PIO_IRQ0_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM7
.equ	PIO_IRQ0_INTS_SM7_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM7_BITS, 0x00008000
.equ	PIO_IRQ0_INTS_SM7_MSB, 15
.equ	PIO_IRQ0_INTS_SM7_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM6
.equ	PIO_IRQ0_INTS_SM6_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM6_BITS, 0x00004000
.equ	PIO_IRQ0_INTS_SM6_MSB, 14
.equ	PIO_IRQ0_INTS_SM6_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM5
.equ	PIO_IRQ0_INTS_SM5_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM5_BITS, 0x00002000
.equ	PIO_IRQ0_INTS_SM5_MSB, 13
.equ	PIO_IRQ0_INTS_SM5_LSB, 13
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM4
.equ	PIO_IRQ0_INTS_SM4_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM4_BITS, 0x00001000
.equ	PIO_IRQ0_INTS_SM4_MSB, 12
.equ	PIO_IRQ0_INTS_SM4_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM3
.equ	PIO_IRQ0_INTS_SM3_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM3_BITS, 0x00000800
.equ	PIO_IRQ0_INTS_SM3_MSB, 11
.equ	PIO_IRQ0_INTS_SM3_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM2
.equ	PIO_IRQ0_INTS_SM2_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM2_BITS, 0x00000400
.equ	PIO_IRQ0_INTS_SM2_MSB, 10
.equ	PIO_IRQ0_INTS_SM2_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM1
.equ	PIO_IRQ0_INTS_SM1_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM1_BITS, 0x00000200
.equ	PIO_IRQ0_INTS_SM1_MSB, 9
.equ	PIO_IRQ0_INTS_SM1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM0
.equ	PIO_IRQ0_INTS_SM0_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM0_BITS, 0x00000100
.equ	PIO_IRQ0_INTS_SM0_MSB, 8
.equ	PIO_IRQ0_INTS_SM0_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM3_TXNFULL
.equ	PIO_IRQ0_INTS_SM3_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM3_TXNFULL_BITS, 0x00000080
.equ	PIO_IRQ0_INTS_SM3_TXNFULL_MSB, 7
.equ	PIO_IRQ0_INTS_SM3_TXNFULL_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM2_TXNFULL
.equ	PIO_IRQ0_INTS_SM2_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM2_TXNFULL_BITS, 0x00000040
.equ	PIO_IRQ0_INTS_SM2_TXNFULL_MSB, 6
.equ	PIO_IRQ0_INTS_SM2_TXNFULL_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM1_TXNFULL
.equ	PIO_IRQ0_INTS_SM1_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM1_TXNFULL_BITS, 0x00000020
.equ	PIO_IRQ0_INTS_SM1_TXNFULL_MSB, 5
.equ	PIO_IRQ0_INTS_SM1_TXNFULL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM0_TXNFULL
.equ	PIO_IRQ0_INTS_SM0_TXNFULL_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM0_TXNFULL_BITS, 0x00000010
.equ	PIO_IRQ0_INTS_SM0_TXNFULL_MSB, 4
.equ	PIO_IRQ0_INTS_SM0_TXNFULL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM3_RXNEMPTY
.equ	PIO_IRQ0_INTS_SM3_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM3_RXNEMPTY_BITS, 0x00000008
.equ	PIO_IRQ0_INTS_SM3_RXNEMPTY_MSB, 3
.equ	PIO_IRQ0_INTS_SM3_RXNEMPTY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM2_RXNEMPTY
.equ	PIO_IRQ0_INTS_SM2_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM2_RXNEMPTY_BITS, 0x00000004
.equ	PIO_IRQ0_INTS_SM2_RXNEMPTY_MSB, 2
.equ	PIO_IRQ0_INTS_SM2_RXNEMPTY_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM1_RXNEMPTY
.equ	PIO_IRQ0_INTS_SM1_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM1_RXNEMPTY_BITS, 0x00000002
.equ	PIO_IRQ0_INTS_SM1_RXNEMPTY_MSB, 1
.equ	PIO_IRQ0_INTS_SM1_RXNEMPTY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ0_INTS_SM0_RXNEMPTY
.equ	PIO_IRQ0_INTS_SM0_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ0_INTS_SM0_RXNEMPTY_BITS, 0x00000001
.equ	PIO_IRQ0_INTS_SM0_RXNEMPTY_MSB, 0
.equ	PIO_IRQ0_INTS_SM0_RXNEMPTY_LSB, 0
# =============================================================================
# Register    : PIO_IRQ1_INTE
# Description : Interrupt Enable for irq1
.equ	PIO_IRQ1_INTE_OFFSET, 0x0000017c
.equ	PIO_IRQ1_INTE_BITS, 0x0000ffff
.equ	PIO_IRQ1_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM7
.equ	PIO_IRQ1_INTE_SM7_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM7_BITS, 0x00008000
.equ	PIO_IRQ1_INTE_SM7_MSB, 15
.equ	PIO_IRQ1_INTE_SM7_LSB, 15
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM6
.equ	PIO_IRQ1_INTE_SM6_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM6_BITS, 0x00004000
.equ	PIO_IRQ1_INTE_SM6_MSB, 14
.equ	PIO_IRQ1_INTE_SM6_LSB, 14
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM5
.equ	PIO_IRQ1_INTE_SM5_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM5_BITS, 0x00002000
.equ	PIO_IRQ1_INTE_SM5_MSB, 13
.equ	PIO_IRQ1_INTE_SM5_LSB, 13
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM4
.equ	PIO_IRQ1_INTE_SM4_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM4_BITS, 0x00001000
.equ	PIO_IRQ1_INTE_SM4_MSB, 12
.equ	PIO_IRQ1_INTE_SM4_LSB, 12
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM3
.equ	PIO_IRQ1_INTE_SM3_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM3_BITS, 0x00000800
.equ	PIO_IRQ1_INTE_SM3_MSB, 11
.equ	PIO_IRQ1_INTE_SM3_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM2
.equ	PIO_IRQ1_INTE_SM2_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM2_BITS, 0x00000400
.equ	PIO_IRQ1_INTE_SM2_MSB, 10
.equ	PIO_IRQ1_INTE_SM2_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM1
.equ	PIO_IRQ1_INTE_SM1_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM1_BITS, 0x00000200
.equ	PIO_IRQ1_INTE_SM1_MSB, 9
.equ	PIO_IRQ1_INTE_SM1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM0
.equ	PIO_IRQ1_INTE_SM0_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM0_BITS, 0x00000100
.equ	PIO_IRQ1_INTE_SM0_MSB, 8
.equ	PIO_IRQ1_INTE_SM0_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM3_TXNFULL
.equ	PIO_IRQ1_INTE_SM3_TXNFULL_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM3_TXNFULL_BITS, 0x00000080
.equ	PIO_IRQ1_INTE_SM3_TXNFULL_MSB, 7
.equ	PIO_IRQ1_INTE_SM3_TXNFULL_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM2_TXNFULL
.equ	PIO_IRQ1_INTE_SM2_TXNFULL_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM2_TXNFULL_BITS, 0x00000040
.equ	PIO_IRQ1_INTE_SM2_TXNFULL_MSB, 6
.equ	PIO_IRQ1_INTE_SM2_TXNFULL_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM1_TXNFULL
.equ	PIO_IRQ1_INTE_SM1_TXNFULL_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM1_TXNFULL_BITS, 0x00000020
.equ	PIO_IRQ1_INTE_SM1_TXNFULL_MSB, 5
.equ	PIO_IRQ1_INTE_SM1_TXNFULL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM0_TXNFULL
.equ	PIO_IRQ1_INTE_SM0_TXNFULL_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM0_TXNFULL_BITS, 0x00000010
.equ	PIO_IRQ1_INTE_SM0_TXNFULL_MSB, 4
.equ	PIO_IRQ1_INTE_SM0_TXNFULL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM3_RXNEMPTY
.equ	PIO_IRQ1_INTE_SM3_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM3_RXNEMPTY_BITS, 0x00000008
.equ	PIO_IRQ1_INTE_SM3_RXNEMPTY_MSB, 3
.equ	PIO_IRQ1_INTE_SM3_RXNEMPTY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM2_RXNEMPTY
.equ	PIO_IRQ1_INTE_SM2_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM2_RXNEMPTY_BITS, 0x00000004
.equ	PIO_IRQ1_INTE_SM2_RXNEMPTY_MSB, 2
.equ	PIO_IRQ1_INTE_SM2_RXNEMPTY_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM1_RXNEMPTY
.equ	PIO_IRQ1_INTE_SM1_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM1_RXNEMPTY_BITS, 0x00000002
.equ	PIO_IRQ1_INTE_SM1_RXNEMPTY_MSB, 1
.equ	PIO_IRQ1_INTE_SM1_RXNEMPTY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PIO_IRQ1_INTE_SM0_RXNEMPTY
.equ	PIO_IRQ1_INTE_SM0_RXNEMPTY_RESET, 0x0
.equ	PIO_IRQ1_INTE_SM0_RXNEMPTY_BITS, 0x00000001
.equ	PIO_IRQ1_INTE_SM0_RXNEMPTY_MSB, 0
.equ	PIO_IRQ1_INTE_SM0_RXNEMPTY_LSB, 0
# =============================================================================
# Register    : PIO_IRQ1_INTF
# Description : Interrupt Force for irq1
.equ	PIO_IRQ1_INTF_OFFSET, 0x00000180
.equ	PIO_IRQ1_INTF_BITS, 0x0000ffff
.equ	PIO_IRQ1_INTF_RESET, 0x00000000
